n5/src/InformationRegisters/RangeStatuses/RangeStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RangeStatuses</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.RangeStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/Forms/Forms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Forms</name>
  <resources>
    <name>Form</name>
    <type>
      <types>DefinedType.FormType</types>
    </type>
  </resources>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.FormStatuses</types>
    </type>
  </attributes>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DefinedType.FormDocument</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/Ranges/Ranges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ranges</name>
  <resources>
    <name>Last</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/FormStatuses/FormStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FormStatuses</name>
  <enumValues>
    <name>Saved</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>Unloaded</name>
  </enumValues>
  <enumValues>
    <name>Printed</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Returned</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/RangeStatuses/RangeStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RangeStatuses</name>
  <enumValues>
    <name>Active</name>
  </enumValues>
  <enumValues>
    <name>Finished</name>
  </enumValues>
  <enumValues>
    <name>Split</name>
  </enumValues>
  <enumValues>
    <name>WrittenOff</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/WriteOffForm/WriteOffForm.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>WriteOffForm</name>
  <registerRecords>AccumulationRegister.Expenses</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <registerRecords>AccumulationRegister.Cost</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.InvoiceRecord</types>
      <types>DocumentRef.ItemsPurchase</types>
      <types>DocumentRef.ServicesPurchase</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/Catalogs/Ranges/Ranges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ranges</name>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Online</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Print</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Real</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Forms</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/CommonModules/RegulatedRanges/Module.bsl
Procedure Enroll ( Object ) export
	
	SetPrivilegedMode ( true );
	rangeData = DF.Values ( Object.Range, "Real, Online, Finish" );
	makeWritingOff ( Object, rangeData );
	makeStatuses ( Object, rangeData );
	if ( ValueIsFilled ( Object.Base ) ) then
		registerForm ( Object );
	endif;
	
EndProcedure

Procedure makeWritingOff ( Object, RangeData )
	
	writing = findWritingOff ( Object );
	if ( Object.Range.IsEmpty ()
		or RangeData.Online
		or not RangeData.Real ) then
		if ( writing <> undefined ) then
			obj = writing.Ref.GetObject ();
			obj.SetDeletionMark ( true );
		endif;
		return;
	endif;
	if ( Object.Status = Enums.FormStatuses.Saved ) then
		if ( writing = undefined ) then
			return;
		elsif ( writing.Posted ) then
			mode = DocumentWriteMode.UndoPosting;
		else
			mode = DocumentWriteMode.Write;
		endif;
	else
		mode = DocumentWriteMode.Posting;
	endif;
	obj = ? ( writing = undefined, Documents.WriteOffForm.CreateDocument (), writing.Ref.GetObject () );
	obj.Fill ( Object );
	obj.Write ( mode );

EndProcedure

Function findWritingOff ( Object )
	
	s = "
	|select top 1 Documents.Ref as Ref, Documents.Posted as Posted
	|from Document.WriteOffForm as Documents
	|where not Documents.DeletionMark
	|and Documents.Base = &Ref
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Object.Ref );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ] );
	
EndFunction

Procedure makeStatuses ( Object, RangeData )
	
	r = InformationRegisters.RangeStatuses.CreateRecordSet ();
	r.Filter.Recorder.Set ( Object.Ref );
	range = Object.Range;
	if ( not range.IsEmpty () ) then
		if ( not RangeData.Online
			and ( Object.FormNumber = RangeData.Finish ) ) then
			movement = r.Add ();
			movement.Period = Object.Date;
			movement.Range = range;
			movement.Status = Enums.RangeStatuses.Finished;
		endif;
	endif;
	r.Write ();
	
EndProcedure

Procedure registerForm ( Object )
	
	document = Object.Base;
	lockForm ( document );
	change = registrationNeeded ( Object );
	if ( change = undefined ) then
		r = InformationRegisters.Forms.CreateRecordManager ();
		r.Document = document;
		r.Delete ();
	elsif ( change ) then
		r = InformationRegisters.Forms.CreateRecordManager ();
		r.Document = document;
		r.Status = Object.Status;
		r.Form = Object.Ref;
		r.Number = Object.Number;
		r.Write ();
	endif;
	
EndProcedure

Procedure lockForm ( Document )
	
	lock = new DataLock ();
	item = lock.Add ( "InformationRegister.Forms" );
	item.Mode = DataLockMode.Exclusive;
	item.SetValue ( "Document", Document );
	lock.Lock ();
	
EndProcedure

Function registrationNeeded ( Object )
	
	formName = Metadata.FindByType ( TypeOf ( Object.Ref ) ).Name;
	s = "
	|select case when Current.Document is null then true else false end as Change
	|from (
	|	select top 1 Last.Ref
	|	from Document." + formName + " as Last
	|	where Last.Base = &Base
	|	and not Last.DeletionMark
	|	order by Last.Date desc
	|) as Last
	|	//
	|	// Current
	|	//
	|	left join InformationRegister.Forms as Current
	|	on Current.Form = Last.Ref
	|";
	q = new Query ( s );
	q.SetParameter ( "Base", Object.Base );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ].Change );
	
EndFunction

Procedure Fill ( Object ) export

	range = Object.Range;
	emptyRange = range.IsEmpty ();
	if ( emptyRange ) then
		data = CoreLibrary.SeriesAndNumber ( Object.Number );
		Object.Series = data.Series;
		documentNumber = data.Number;
		Object.FormNumber = documentNumber;
		Object.Number = RegulatedRanges.BuildNumber ( , Object.Series, documentNumber );
	else
		if ( DF.Pick ( Object.Range, "Online" ) ) then
			changedManually = ( Object.Number = "" ) and not emptyNumber ( Object );  
			if ( changedManually ) then
				Object.Number = RegulatedRanges.BuildNumber ( range, Object.Series, Object.FormNumber );
			endif;
		else
			if ( emptyNumber ( Object ) ) then
				data = getNext ( range );
				Object.Series = data.Series;
				Object.FormNumber = data.Number;
			else
				pushNumber ( range, Object.Series, Object.FormNumber );
			endif;
			Object.Number = RegulatedRanges.BuildNumber ( range, Object.Series, Object.FormNumber );
		endif;
	endif;

EndProcedure

Function emptyNumber ( Object )
	
	return IsBlankString ( Object.Series ) and Object.FormNumber = 0;
	
EndFunction

Function getNext ( Range )
	
	lock ( Range );
	data = getData ( Range );
	return newNumber ( range, data );
	
EndFunction

Procedure lock ( Range )
	
	lock = new DataLock ();
	item = lock.Add ( "InformationRegister.Ranges" );
	item.Mode = DataLockMode.Exclusive;
	item.SetValue ( "Range", Range );
	lock.Lock ();
	
EndProcedure

Function getData ( Range )
	
	s = "
	|select Ranges.Prefix as Prefix, Ranges.Start as Start, Ranges.Finish as Finish,
	|	isnull ( LastRanges.Last + 1, Ranges.Start ) as Next, Statuses.Status as Status
	|from Catalog.Ranges as Ranges
	|	//
	|	// LastRanges
	|	//
	|	left join InformationRegister.Ranges as LastRanges
	|	on LastRanges.Range = Ranges.Ref
	|	//
	|	// Statuses
	|	//
	|	left join InformationRegister.RangeStatuses as Statuses
	|	on Statuses.Range = Ranges.Ref
	|where Ranges.Ref = &Range
	|";
	q = new Query ( s );
	q.SetParameter ( "Range", Range );
	return q.Execute ().Unload () [ 0 ];
	
EndFunction

Function newNumber ( Range, Data )
	
	next = data.Next;
	if ( next > data.Finish ) then
		raise Output.RangeFinished ( new Structure ( "Range", Range ) );
	elsif ( data.Status = null ) then
		raise Output.RangeInactive ( new Structure ( "Range", Range ) );
	endif;
	commit ( Range, next );
	return new Structure ( "Series, Number", Data.Prefix, next );
	
EndFunction

Procedure commit ( Range, Number )
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.Ranges.CreateRecordManager ();
	r.Range = Range;
	r.Last = Number;
	r.Write ();
	
EndProcedure

Function BuildNumber ( Range = undefined, Series, Number, Next = false ) export
	
	prefix = TrimR ( Series );
	if ( Range = undefined ) then
		if ( Next ) then
			n = 1 + Conversion.StringToNumber ( Number );
			n = formatNumber ( n, StrLen ( Number ) );
		else
			n = Number;
		endif;
		return prefix + n;
	else
		n = ? ( Next, Number + 1, Number );
		return prefix + formatNumber ( n, DF.Pick ( Range, "Length" ) );
	endif;
	
EndFunction

Function formatNumber ( Number, Lengh )

	return Format ( Number, "NG=;NLZ=;ND=" + Lengh );

EndFunction

Procedure pushNumber ( Range, Series, Number )
	
	lock ( Range );
	data = getData ( Range );
	shiftRange ( Range, Series, Number, data );
	
EndProcedure

Procedure shiftRange ( Range, Series, Number, Data )
	
	if ( data.Status = null ) then
		raise Output.RangeInactive ( new Structure ( "Range", Range ) );
	endif;
	ok = TrimAll ( Series ) = data.Prefix
	and Number >= data.Start
	and Number <= data.Finish;
	if ( not ok ) then
		raise Output.RangeError ( new Structure ( "Range, Series, Number", Range, Series, Number ) );
	endif;
	shift = ( Number - data.Next );
	if ( shift = 0 ) then
		commit ( Range, Number );
	elsif ( shift > 0 ) then
		raise Output.RangeJumpstart ( new Structure ( "Range, Number", Range, Number ) );
	endif;
	
EndProcedure

Function Duplication ( Object ) export
	
	SetPrivilegedMode ( true );
	if ( numberComing ( Object )
		or formNotFound ( Object ) ) then
		return false;
	else
		Output.FormExists ( , "FormNumber", Object.Ref );
		return true;
	endif;
	
EndFunction

Function numberComing ( Object )
	
	return DF.Pick ( Object.Range, "Online" )
	and Object.Series = ""
	and Object.FormNumber = 0;
	
EndFunction

Function formNotFound ( Object )
	
	meta = Metadata.FindByType ( TypeOf ( Object.Ref ) );
	s = "
	|select top 1 1
	|from Document." + meta.Name + " as Documents
	|where Documents.Number = &Number
	|and Documents.Ref <> &Ref
	|";
	q = new Query ( s );
	q.SetParameter ( "Number", Object.Number );
	q.SetParameter ( "Ref", Object.Ref );
	return q.Execute ().IsEmpty ();
	
EndFunction
